# Insulation Material Dispose Method

Source: https://www.revitapidocs.com/2026/238de481-74d0-56fc-3bad-6f2be69beb5f.htm

---

| Insulation Material Dispose Method |
| --- |

Releases all resources used by the InsulationMaterial
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

InsulationMaterial Class Autodesk.Revit.DB.Electrical Namespace